In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [8]:
ser=Series([2,3,-3,5,3],index=['a','b','c','d','e'])
ser

a    2
b    3
c   -3
d    5
e    3
dtype: int64

In [9]:
ser.values

array([ 2,  3, -3,  5,  3], dtype=int64)

In [10]:
ser.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
ser['a']

2

In [12]:
ser[ser>2]

b    3
d    5
e    3
dtype: int64

In [13]:
'c' in ser

True

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
Series(sdata)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df= DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [19]:
df=DataFrame(data, columns=['year', 'state', 'pop'])
df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [20]:
df2= DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [21]:
df.columns

Index(['year', 'state', 'pop'], dtype='object')

In [23]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [27]:
df2['eastern'] = df2.state == 'Ohio'
df2

       year   state  pop debt  eastern
one    2000    Ohio  1.5  NaN     True
two    2001    Ohio  1.7  NaN     True
three  2002    Ohio  3.6  NaN     True
four   2001  Nevada  2.4  NaN    False
five   2002  Nevada  2.9  NaN    False

In [28]:
del df2['eastern']

In [29]:
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [30]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} 
f=DataFrame(pop)

In [31]:
f

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [32]:
f.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [33]:
 DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [34]:
f.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [36]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [39]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [44]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [46]:
import numpy as np
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [47]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [48]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data>5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [50]:
data[data>2]='hi'

In [51]:
data

         one two three four
Ohio       0   1     2   hi
Colorado  hi  hi    hi   hi
Utah      hi  hi    hi   hi
New York  hi  hi    hi   hi

In [52]:
data.ix['Colorado', ['two', 'three']]

C:\Users\DeLL\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\DeLL\Anaconda3\lib\site-packages\pandas\core\indexing.py:961: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  return getattr(section, self.name)[new_key]

two      hi
three    hi
Name: Colorado, dtype: object

In [53]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [54]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [56]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

**Function application and mapping**

In [59]:
df= DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df

               b         d         e
Utah   -1.237244 -1.249496 -1.480045
Ohio   -0.016933 -0.917472 -1.114996
Texas  -0.878949 -0.880293  1.725533
Oregon -0.458704  0.083631 -0.354559

In [60]:
np.abs(df)

               b         d         e
Utah    1.237244  1.249496  1.480045
Ohio    0.016933  0.917472  1.114996
Texas   0.878949  0.880293  1.725533
Oregon  0.458704  0.083631  0.354559

In [61]:
f = lambda x: x.max() - x.min()
df.apply(f)

b    1.220310
d    1.333127
e    3.205578
dtype: float64

In [62]:
df.apply(f,axis=1)

Utah      0.242801
Ohio      1.098063
Texas     2.605826
Oregon    0.542335
dtype: float64

In [64]:
format = lambda x: '%.2f' % x
df.applymap(format)

            b      d      e
Utah    -1.24  -1.25  -1.48
Ohio    -0.02  -0.92  -1.11
Texas   -0.88  -0.88   1.73
Oregon  -0.46   0.08  -0.35

**Sorting and ranking**

In [65]:
df=DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [66]:
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [69]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [71]:
df.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [74]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [75]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [78]:
frame.sort_index(by='a')

C:\Users\DeLL\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [80]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [3]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [4]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [5]:
 obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [8]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

**Axis indexes with duplicate values**

In [12]:
obj=Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [13]:
obj.index.is_unique

False

In [16]:
import numpy as np
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.873343 -1.564945 -2.212133
a  0.259476  1.027496  0.612659
b  0.437329  1.264410  0.755457
b  0.324975 -0.566592 -0.245162

In [21]:
df.loc['b']

          0         1         2
b  0.437329  1.264410  0.755457
b  0.324975 -0.566592 -0.245162

In [22]:
df.idxmax()

0    a
1    b
2    b
dtype: object

In [23]:
df.idxmin()

0    a
1    a
2    a
dtype: object

In [24]:
df.cumsum()

          0         1         2
a  0.873343 -1.564945 -2.212133
a  1.132819 -0.537449 -1.599475
b  1.570148  0.726962 -0.844018
b  1.895123  0.160370 -1.089180

In [26]:
df.kurt()

0    2.562374
1   -3.311928
2    1.682975
dtype: float64

In [27]:
df.skew()

0    1.599143
1   -0.428553
2   -1.441967
dtype: float64

In [29]:
df.mad()   #mean aabsolute deviation

0    0.199781
1    1.105861
2    0.969919
dtype: float64

In [31]:
#Correlation and Covariance

In [32]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [33]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

**Hierarchical Indexing**

#Hierarchical indexing is an important feature of pandas enabling you to have multiple (two or more) index levels on an axis.

In [36]:
 data = Series(np.random.randn(10),index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [37]:
data

a  1    0.389960
   2   -0.986071
   3    0.738081
b  1   -0.856232
   2    0.502170
   3    1.519134
c  1    1.762033
   2    0.163320
d  2   -0.879734
   3    1.613482
dtype: float64

In [38]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [39]:
data['b']

1   -0.856232
2    0.502170
3    1.519134
dtype: float64

In [43]:
data['b':'c']

b  1   -0.856232
   2    0.502170
   3    1.519134
c  1    1.762033
   2    0.163320
dtype: float64

In [44]:
data.unstack()

          1         2         3
a  0.389960 -0.986071  0.738081
b -0.856232  0.502170  1.519134
c  1.762033  0.163320       NaN
d       NaN -0.879734  1.613482

In [45]:
data.unstack().stack()

a  1    0.389960
   2   -0.986071
   3    0.738081
b  1   -0.856232
   2    0.502170
   3    1.519134
c  1    1.762033
   2    0.163320
d  2   -0.879734
   3    1.613482
dtype: float64

In [47]:
frame = DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [48]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],'d': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [53]:
df2=frame.set_index(['c','d'])
df2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [54]:
df2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [55]:
df2.sort_index(axis=1)

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1